deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
/*
*********************************************************************************************************
*	函 数 名: comSendBuf
*	功能说明: 向串口发送一组数据。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*	形    参: _ucPort: 端口号(COM1 - COM8)
*			  _ucaBuf: 待发送的数据缓冲区
*			  _usLen : 数据长度
*	返 回 值: 无
*********************************************************************************************************
*/
void comSendBuf(COM_PORT_E _ucPort, uint8_t *_ucaBuf, uint16_t _usLen)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);

    if (pUart == 0)
    {
        return;
    }

#if UART4_FIFO_EN == 1
    if (pUart->uart == USART4)
    {
        uart4_dma_tx_start(_ucaBuf, _usLen);
        return;
    }
#endif
#if UART6_FIFO_EN == 1
    if (pUart->uart == USART6)
    {
        uart6_dma_tx_start(_ucaBuf, _usLen);
        return;
    }
#endif
    /* TX via FIFO + TXE interrupt for other uarts */

//	if (pUart->SendBefor != 0)
//	{
//		pUart->SendBefor();		/* 如果是RS485通信，可以在这个函数中将RS485设置为发送模式 */
//	}

    UartSend(pUart, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*	函 数 名: comSendChar
*	功能说明: 向串口发送1个字节。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*	形    参: _ucPort: 端口号(COM1 - COM8)
*			  _ucByte: 待发送的数据
*	返 回 值: 无
*********************************************************************************************************
*/
void comSendChar(COM_PORT_E _ucPort, uint8_t _ucByte)
{
    comSendBuf(_ucPort, &_ucByte, 1);
}

/*
*********************************************************************************************************
*	函 数 名: comGetChar
*	功能说明: 从接收缓冲区读取1字节，非阻塞。无论有无数据均立即返回。
*	形    参: _ucPort: 端口号(COM1 - COM8)
*			  _pByte: 接收到的数据存放在这个地址
*	返 回 值: 0 表示无数据, 1 表示读取到有效字节
*********************************************************************************************************
*/
uint8_t comGetChar(COM_PORT_E _ucPort, uint8_t *_pByte)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);

    if (pUart == 0)
    {
        return 0;
    }

    return UartGetChar(pUart, _pByte);
}

/*
*********************************************************************************************************
*	函 数 名: comClearTxFifo
*	功能说明: 清零串口发送缓冲区
*	形    参: _ucPort: 端口号(COM1 - COM8)
*	返 回 值: 无
*********************************************************************************************************
*/
void comClearTxFifo(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);

    if (pUart == 0)
    {
        return;
    }

    pUart->usTxWrite = 0;
    pUart->usTxRead = 0;
    pUart->usTxCount = 0;
}

/*
*********************************************************************************************************
*	函 数 名: comClearRxFifo
*	功能说明: 清零串口接收缓冲区
*	形    参: _ucPort: 端口号(COM1 - COM8)
*	返 回 值: 无
*********************************************************************************************************
*/
void comClearRxFifo(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);

    if (pUart == 0)
    {
        return;
    }

    pUart->usRxWrite = 0;
    pUart->usRxRead = 0;
    pUart->usRxCount = 0;
}

/*
*********************************************************************************************************
*	函 数 名: comSetBaud
*	功能说明: 设置串口的波特率. 本函数固定设置为无校验，收发都使能模式
*	形    参: _ucPort: 端口号(COM1 - COM8)
*			  _BaudRate: 波特率，8倍过采样  波特率.0-12.5Mbps
*                                16倍过采样 波特率.0-6.25Mbps
*	返 回 值: 无
*********************************************************************************************************
*/
void comSetBaud(COM_PORT_E _ucPort, uint32_t _BaudRate)
{
    USART_TypeDef* USARTx;

    USARTx = ComToUSARTx(_ucPort);

    if (USARTx == 0)
    {
        return;
    }

    bsp_SetUartParam(USARTx,  _BaudRate, UART_PARITY_NONE, UART_MODE_TX_RX);
}


/*
*********************************************************************************************************
*	函 数 名: UartVarInit
*	功能说明: 初始化串口相关的变量
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartVarInit(void)
{
    #if UART1_FIFO_EN == 1
    g_tUart1.uart = USART1;						/* STM32 串口设备 */
    g_tUart1.pTxBuf = g_TxBuf1;					/* 发送缓冲区指针 */
    g_tUart1.pRxBuf = g_RxBuf1;					/* 接收缓冲区指针 */
    g_tUart1.usTxBufSize = UART1_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart1.usRxBufSize = UART1_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart1.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart1.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart1.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart1.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart1.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart1.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart1.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart1.SendOver = 0;						/* 发送完毕后的回调函数 */
    g_tUart1.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart1.Sending = 0;						/* 正在发送中标志 */
    g_tUart1.uartirq = USART1_IRQn;
    #endif

    #if UART2_FIFO_EN == 1
    g_tUart2.uart = USART2;						/* STM32 串口设备 */
    g_tUart2.pTxBuf = g_TxBuf2;					/* 发送缓冲区指针 */
    g_tUart2.pRxBuf = g_RxBuf2;					/* 接收缓冲区指针 */
    g_tUart2.usTxBufSize = UART2_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart2.usRxBufSize = UART2_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart2.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart2.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart2.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart2.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart2.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart2.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart2.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart2.SendOver = 0;						/* 发送完毕后的回调函数 */
    g_tUart2.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart2.Sending = 0;						/* 正在发送中标志 */
    g_tUart2.uartirq = USART2_IRQn;
    #endif

    #if UART3_FIFO_EN == 1
    g_tUart3.uart = USART3;						/* STM32 串口设备 */
    g_tUart3.pTxBuf = g_TxBuf3;					/* 发送缓冲区指针 */
    g_tUart3.pRxBuf = g_RxBuf3;					/* 接收缓冲区指针 */
    g_tUart3.usTxBufSize = UART3_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart3.usRxBufSize = UART3_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart3.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart3.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart3.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart3.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart3.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart3.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart3.SendBefor = 0;		/* 发送数据前的回调函数 */
    g_tUart3.SendOver  = 0;			/* 发送完毕后的回调函数 */
    g_tUart3.ReciveNew = 0;		/* 接收到新数据后的回调函数 */
    g_tUart3.Sending = 0;						/* 正在发送中标志 */
    g_tUart3.uartirq = USART3_6_IRQn;
    #endif

    #if UART4_FIFO_EN == 1
    g_tUart4.uart = USART4;						/* STM32 串口设备 */
    g_tUart4.pTxBuf = g_TxBuf4;					/* 发送缓冲区指针 */
    g_tUart4.pRxBuf = g_RxBuf4;					/* 接收缓冲区指针 */
    g_tUart4.usTxBufSize = UART4_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart4.usRxBufSize = UART4_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart4.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart4.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart4.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart4.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart4.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart4.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart4.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart4.SendOver  = 0;						/* 发送完毕后的回调函数 */
    g_tUart4.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart4.Sending = 0;						/* 正在发送中标志 */
    g_tUart4.uartirq = USART3_6_IRQn;
    #endif

    #if UART5_FIFO_EN == 1
    g_tUart5.uart = USART5;						/* STM32 串口设备 */
    g_tUart5.pTxBuf = g_TxBuf5;					/* 发送缓冲区指针 */
    g_tUart5.pRxBuf = g_RxBuf5;					/* 接收缓冲区指针 */
    g_tUart5.usTxBufSize = UART5_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart5.usRxBufSize = UART5_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart5.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart5.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart5.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart5.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart5.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart5.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart5.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart5.SendOver = 0;						/* 发送完毕后的回调函数 */
    g_tUart5.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart5.Sending = 0;						  /* 正在发送中标志 */
    g_tUart5.uartirq = USART3_6_IRQn;
    #endif


    #if UART6_FIFO_EN == 1
    g_tUart6.uart = USART6;						/* STM32 串口设备 */
    g_tUart6.pTxBuf = g_TxBuf6;					/* 发送缓冲区指针 */
    g_tUart6.pRxBuf = g_RxBuf6;					/* 接收缓冲区指针 */
    g_tUart6.usTxBufSize = UART6_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart6.usRxBufSize = UART6_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart6.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart6.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart6.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart6.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart6.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart6.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart6.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart6.SendOver = 0;						/* 发送完毕后的回调函数 */
    g_tUart6.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart6.Sending = 0;						/* 正在发送中标志 */
    g_tUart6.uartirq = USART3_6_IRQn;
    #endif


