deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
}

/*
*********************************************************************************************************
*	函 数 名: bsp_SetUartParam
*	功能说明: 配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）适合于STM32- H7开发板
*	形    参: Instance   USART_TypeDef类型结构体
*             BaudRate   波特率
*             Parity     校验类型，奇校验或者偶校验
*             Mode       发送和接收模式使能
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_SetUartParam(USART_TypeDef *Instance,  uint32_t BaudRate, uint32_t Parity, uint32_t Mode)
{
    UART_HandleTypeDef UartHandle;

    /*##-1- 配置串口硬件参数 ######################################*/
    /* 异步串口模式 (UART Mode) */
    /* 配置如下:
      - 字长    = 8 位
      - 停止位  = 1 个停止位
      - 校验    = 参数Parity
      - 波特率  = 参数BaudRate
      - 硬件流控制关闭 (RTS and CTS signals) */

    UartHandle.Instance        = Instance;

    UartHandle.Init.BaudRate   = BaudRate;
    UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
    UartHandle.Init.StopBits   = UART_STOPBITS_1;
    UartHandle.Init.Parity     = Parity;
    UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
    UartHandle.Init.Mode       = Mode;
    UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;
    UartHandle.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    UartHandle.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&UartHandle) != HAL_OK)
    {
        Error_Handler();
    }
}

/*
*********************************************************************************************************
*	函 数 名: InitHardUart
*	功能说明: 配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）适合于STM32-H7开发板
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void InitHardUart(void)
{
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_USART4_UART_Init();
    MX_USART5_UART_Init();
    MX_USART6_UART_Init();
#if UART6_FIFO_EN == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);
#endif
#if UART4_FIFO_EN == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    HAL_NVIC_SetPriority(DMA1_Channel4_5_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel4_5_IRQn);
#endif
}

/*
*********************************************************************************************************
*	函 数 名: UartSend
*	功能说明: 填写数据到UART发送缓冲区,并启动发送中断。中断处理函数发送完毕后，自动关闭发送中断
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartSendBlocking(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen)
{
    uint16_t i;
    /* disable IRQ-driven TX so nothing else writes TDR */
    CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);
    CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TCIE);
    for (i = 0u; i < _usLen; i++)
    {
        while ((_pUart->uart->ISR & USART_ISR_TXE) == 0u) { }
        _pUart->uart->TDR = _ucaBuf[i];
    }
    /* HAL-style: wait TC (last byte fully shifted out) */
    while ((_pUart->uart->ISR & USART_ISR_TC) == 0u) { }
    SET_BIT(_pUart->uart->ICR, USART_ICR_TCCF);
}

static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen)
{
    uint16_t i;

    for (i = 0; i < _usLen; i++)
    {
        /* 如果发送缓冲区已经满了，则等待缓冲区空 */
        while (1)
        {
            __IO uint16_t usCount;

            HAL_NVIC_DisableIRQ(_pUart->uartirq);
            usCount = _pUart->usTxCount;
            HAL_NVIC_EnableIRQ(_pUart->uartirq);

            if (usCount < _pUart->usTxBufSize)
            {
                break;
            }
            else if(usCount == _pUart->usTxBufSize)/* 数据已填满缓冲区 */
            {
                if((_pUart->uart->CR1 & USART_CR1_TXEIE) == 0)
                {
                    SET_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);
                }
            }
        }

        /* 将新数据填入发送缓冲区 */
        _pUart->pTxBuf[_pUart->usTxWrite] = _ucaBuf[i];

        //DISABLE_INT();
        HAL_NVIC_DisableIRQ(_pUart->uartirq);

        if (++_pUart->usTxWrite >= _pUart->usTxBufSize)
        {
            _pUart->usTxWrite = 0;
        }

        _pUart->usTxCount++;
        //ENABLE_INT();
        HAL_NVIC_EnableIRQ(_pUart->uartirq);
    }

    SET_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);	/* 使能发送中断（缓冲区空） */
}

/* UART6 DMA TX via CH2: disable TXE/TC IRQ first so ISR does not race DMA */
static void uart6_dma_tx_start(const uint8_t *src, uint16_t len)
{
    uint16_t i;
    if (g_u6txbusy != 0u) { return; }
    if (len > UART6_TX_DMA_BUF) { return; }
    for (i = 0u; i < len; i++) { g_u6txbuf[i] = src[i]; }
    /* stop interrupt-driven TX on USART6 so DMA owns TDR */
    CLEAR_BIT(USART6->CR1, USART_CR1_TXEIE);
    CLEAR_BIT(USART6->CR1, USART_CR1_TCIE);
    DMA1_Channel2->CCR = 0u;
    DMA1_Channel2->CMAR = (uint32_t)g_u6txbuf;
    DMA1_Channel2->CPAR = (uint32_t)&USART6->TDR;
    DMA1_Channel2->CNDTR = len;
    DMA1->CSELR = (DMA1->CSELR & ~DMA1_CSELR_CH2_USART6_TX_Msk) | DMA1_CSELR_CH2_USART6_TX;
    DMA1_Channel2->CCR = DMA_CCR_DIR | DMA_CCR_MINC | DMA_CCR_TCIE | DMA_CCR_EN;
    SET_BIT(USART6->CR3, USART_CR3_DMAT);
    g_u6txbusy = 1u;
}

/* DMA1 CH2 TX complete (UART6) */
void DMA1_Channel2_3_IRQHandler(void)
{
    if ((DMA1->ISR & DMA_ISR_TCIF2) != 0u)
    {
        DMA1->IFCR = DMA_IFCR_CTCIF2;
        CLEAR_BIT(USART6->CR3, USART_CR3_DMAT);
        SET_BIT(USART6->ICR, USART_ICR_TCCF);
        g_u6txbusy = 0u;
    }
#if UART3_FIFO_EN == 1 && UART3_DMA_RX == 1
    if ((DMA1->ISR & DMA_ISR_TCIF3) != 0u)
    {
        DMA1->IFCR = DMA_IFCR_CTCIF3;   /* U3 RX DMA circular TC */
    }
#endif
}

/* UART4 DMA TX via CH4 */
static void uart4_dma_tx_start(const uint8_t *src, uint16_t len)
{
    uint16_t i;
    if (g_u4txbusy != 0u) { return; }
    if (len > UART4_TX_DMA_BUF) { return; }
    for (i = 0u; i < len; i++) { g_u4txbuf[i] = src[i]; }
    CLEAR_BIT(USART4->CR1, USART_CR1_TXEIE);
    CLEAR_BIT(USART4->CR1, USART_CR1_TCIE);
    DMA1_Channel4->CCR = 0u;
    DMA1_Channel4->CMAR = (uint32_t)g_u4txbuf;
    DMA1_Channel4->CPAR = (uint32_t)&USART4->TDR;
    DMA1_Channel4->CNDTR = len;
    DMA1->CSELR = (DMA1->CSELR & ~DMA1_CSELR_CH4_USART4_TX_Msk) | DMA1_CSELR_CH4_USART4_TX;
    DMA1_Channel4->CCR = DMA_CCR_DIR | DMA_CCR_MINC | DMA_CCR_TCIE | DMA_CCR_EN;
    SET_BIT(USART4->CR3, USART_CR3_DMAT);
    g_u4txbusy = 1u;
}

void DMA1_Channel4_5_IRQHandler(void)
{
    if ((DMA1->ISR & DMA_ISR_TCIF4) != 0u)
    {
        DMA1->IFCR = DMA_IFCR_CTCIF4;
        CLEAR_BIT(USART4->CR3, USART_CR3_DMAT);
        SET_BIT(USART4->ICR, USART_ICR_TCCF);
        g_u4txbusy = 0u;
    }
#if UART5_FIFO_EN == 1 && UART5_DMA_RX == 1
    if ((DMA1->ISR & DMA_ISR_TCIF5) != 0u)
    {
        DMA1->IFCR = DMA_IFCR_CTCIF5;   /* U5 RX DMA circular TC */
    }
#endif
}

