deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
/*
*********************************************************************************************************
*	函 数 名: UartGetChar
*	功能说明: 从串口接收缓冲区读取1字节数据 （用于主程序调用）
*	形    参: _pUart : 串口设备
*			  _pByte : 存放读取数据的指针
*	返 回 值: 0 表示无数据  1表示读取到数据
*********************************************************************************************************
*/
static uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte)
{
    /* fast path: no critical section when FIFO empty (most polls) */
    if (_pUart->usRxCount == 0)
    {
        return 0;
    }

    /* single critical section: pop one byte and advance the read index */
    HAL_NVIC_DisableIRQ(_pUart->uartirq);
    if (_pUart->usRxCount == 0)   /* re-check inside critical section */
    {
        HAL_NVIC_EnableIRQ(_pUart->uartirq);
        return 0;
    }

    *_pByte = _pUart->pRxBuf[_pUart->usRxRead];
    if (++_pUart->usRxRead >= _pUart->usRxBufSize)
    {
        _pUart->usRxRead = 0;
    }
    _pUart->usRxCount--;
    HAL_NVIC_EnableIRQ(_pUart->uartirq);
    return 1;
}

uint16_t UartGetRxcnt(COM_PORT_E _ucPort)
{
    uint16_t usCount;
    UART_T  *_pUart;
    _pUart = ComToUart(_ucPort);
    /* usRxWrite 变量在中断函数中被改写，主程序读取该变量时，必须进行临界区保护 */
    HAL_NVIC_DisableIRQ(_pUart->uartirq);
    usCount = _pUart->usRxCount;
    HAL_NVIC_EnableIRQ(_pUart->uartirq);
    return usCount;
}

/*
*********************************************************************************************************
*   函 数 名: UartTxEmpty
*   功能说明: 判断发送缓冲区是否为空。
*   形    参:  _pUart : 串口设备
*   返 回 值: 1为空。0为不空。
*********************************************************************************************************
*/
uint8_t UartTxEmpty(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);

    if (pUart == 0)
    {
        return 0;
    }

#if UART4_FIFO_EN == 1
    /* UART4 TX is DMA driven: busy flag AND DMAT bit must both be clear */
    if (pUart->uart == USART4)
    {
        return ((g_u4txbusy == 0u) && ((USART4->CR3 & USART_CR3_DMAT) == 0u)) ? 1u : 0u;
    }
#endif
#if UART6_FIFO_EN == 1
    /* UART6 TX is DMA driven: busy flag AND DMAT bit must both be clear */
    if (pUart->uart == USART6)
    {
        return ((g_u6txbusy == 0u) && ((USART6->CR3 & USART_CR3_DMAT) == 0u)) ? 1u : 0u;
    }
#endif
    /* Interrupt + FIFO TX path: empty only when no queued byte and none in flight */
    if ((pUart->usTxCount != 0u) || (pUart->Sending != 0u))
    {
        return 0;
    }

    return 1;
}

/*
*********************************************************************************************************
*   函 数 名: UartTxWait
*   功能说明: 等待发送缓冲区空闲，避免上一包尚未发完就重新启动发送导致丢包。
*   形     参:  _ucPort : 串口设备 ; _timeoutMs : 最长等待时间(ms)
*   返 回 值: 1 表示空闲(可发送) ; 0 表示超时仍忙
*********************************************************************************************************
*/
uint8_t UartTxWait(COM_PORT_E _ucPort, uint32_t _timeoutMs)
{
    uint32_t t0 = HAL_GetTick();

    while (UartTxEmpty(_ucPort) == 0u)
    {
        if ((HAL_GetTick() - t0) >= _timeoutMs)
        {
            return 0;
        }
    }

    return 1;
}

/*
*********************************************************************************************************
*	函 数 名: UartIRQ
*	功能说明: 供中断服务程序调用，通用串口中断处理函数
*	形    参: _pUart : 串口设备
*	返 回 值: 无
*********************************************************************************************************
*/
#if (UART3_FIFO_EN == 1 && UART3_DMA_RX == 1) || (UART4_FIFO_EN == 1 && UART4_DMA_RX == 1) || (UART5_FIFO_EN == 1 && UART5_DMA_RX == 1)
/* --- channel UARTs RX via DMA circular + IDLE (experiment) --- */
#define UART_DMA_LEN   (512u)

#if UART3_FIFO_EN == 1 && UART3_DMA_RX == 1
static uint8_t  g_u3dma[UART_DMA_LEN];
static uint16_t g_u3dma_last = 0u;
#endif
#if UART4_FIFO_EN == 1 && UART4_DMA_RX == 1
static uint8_t  g_u4dma[UART_DMA_LEN];
static uint16_t g_u4dma_last = 0u;
#endif
#if UART5_FIFO_EN == 1 && UART5_DMA_RX == 1
static uint8_t  g_u5dma[UART_DMA_LEN];
static uint16_t g_u5dma_last = 0u;
#endif

/* move new bytes from circular DMA buf into the uart RX ring */
static void uart_dma_rx_move(DMA_Channel_TypeDef *ch, uint8_t *dma, uint16_t *last, UART_T *pu)
{
    uint16_t cur;
    uint16_t got;
    uint16_t i;
    uint16_t w;

    cur = (uint16_t)(UART_DMA_LEN - (uint16_t)READ_REG(ch->CNDTR));
    if (cur == *last) { return; }
    if (cur > *last)
    {
        got = (uint16_t)(cur - *last);
        for (i = 0u; i < got; i++)
        {
            w = pu->usRxWrite;
            pu->pRxBuf[w] = dma[(*last + i) & (UART_DMA_LEN - 1u)];
            if (++w >= pu->usRxBufSize) { w = 0u; }
            pu->usRxWrite = w;
            if (pu->usRxCount < pu->usRxBufSize) { pu->usRxCount++; }
        }
    }
    else
    {
        got = (uint16_t)(UART_DMA_LEN - *last);
        for (i = 0u; i < got; i++)
        {
            w = pu->usRxWrite;
            pu->pRxBuf[w] = dma[(*last + i) & (UART_DMA_LEN - 1u)];
            if (++w >= pu->usRxBufSize) { w = 0u; }
            pu->usRxWrite = w;
            if (pu->usRxCount < pu->usRxBufSize) { pu->usRxCount++; }
        }
        got = cur;
        for (i = 0u; i < got; i++)
        {
            w = pu->usRxWrite;
            pu->pRxBuf[w] = dma[i];
            if (++w >= pu->usRxBufSize) { w = 0u; }
            pu->usRxWrite = w;
            if (pu->usRxCount < pu->usRxBufSize) { pu->usRxCount++; }
        }
    }
    *last = cur;
}

/* enable DMA circular RX on one channel uart; called from MX_xxx */
static void uart_dma_rx_cfg(DMA_Channel_TypeDef *ch, uint32_t cselr_msk, uint32_t cselr_val,
                            uint8_t *dma, uint16_t *last, USART_TypeDef *uart)
{
    ch->CCR = 0u;
    ch->CMAR = (uint32_t)dma;
    ch->CPAR = (uint32_t)&uart->RDR;
    ch->CNDTR = UART_DMA_LEN;
    DMA1->CSELR = (DMA1->CSELR & ~cselr_msk) | cselr_val;
    ch->CCR = DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_EN;
    *last = 0u;
    CLEAR_BIT(uart->CR1, USART_CR1_RXNEIE);
    SET_BIT(uart->CR3, USART_CR3_DMAR);
    SET_BIT(uart->CR1, USART_CR1_IDLEIE);
}
#endif
static void UartIRQ_DmaIdle(UART_T *_pUart)
{
    uint32_t isrflags   = READ_REG(_pUart->uart->ISR);
    uint32_t cr1its     = READ_REG(_pUart->uart->CR1);
    uint32_t cr3its     = READ_REG(_pUart->uart->CR3);

