deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
void USART1_IRQHandler(void)
{
    UartIRQ(&g_tUart1);
}

#endif

#if UART2_FIFO_EN == 1

void USART2_IRQHandler(void)
{
    UartIRQ(&g_tUart2);
}

#endif

#if UART3_FIFO_EN == 1

void USART3_6_IRQHandler(void)
{
    /* service: worst-loss uarts first */
    UartIRQ(&g_tUart6);
#if (UART3_FIFO_EN == 1 && UART3_DMA_RX == 1) || (UART4_FIFO_EN == 1 && UART4_DMA_RX == 1) || (UART5_FIFO_EN == 1 && UART5_DMA_RX == 1)
    UartIRQ_DmaIdle(&g_tUart4);
    UartIRQ(&g_tUart4);
    UartIRQ_DmaIdle(&g_tUart3);
    UartIRQ(&g_tUart3);
    UartIRQ_DmaIdle(&g_tUart5);
    UartIRQ(&g_tUart5);
#endif
}

#endif




/*
*********************************************************************************************************
*	函 数 名: fputc
*	功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fputc(int ch, FILE *f)
{
    #if 1	/* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
    comSendChar(COM1, ch);

    return ch;
    #else	/* 采用阻塞方式发送每个字符,等待数据发送完毕 */
    /* 写一个字节到USART1 */
    USART1->TDR = ch;

    /* 等待发送结束 */
    while((USART1->ISR & USART_ISR_TC) == 0)
    {}

    return ch;
    #endif
}

/*
*********************************************************************************************************
*	函 数 名: fgetc
*	功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f)
{

    #if 1	/* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
    uint8_t ucData;

    while(comGetChar(COM1, &ucData) == 0);

    return ucData;
    #else

    /* 等待接收到数据 */
    while((USART1->ISR & USART_ISR_RXNE) == 0)
    {}

    return (int)USART1->RDR;
    #endif
}



static void MX_USART1_UART_Init(void)
{

    /* USER CODE END USART1_Init 1 */
    IPC_huart1.Instance = USART1;
    IPC_huart1.Init.BaudRate = UART1_BAUD;
    IPC_huart1.Init.WordLength = UART_WORDLENGTH_8B;
    IPC_huart1.Init.StopBits = UART_STOPBITS_1;
    IPC_huart1.Init.Parity = UART_PARITY_NONE;
    IPC_huart1.Init.Mode = UART_MODE_TX_RX;
    IPC_huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    IPC_huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    IPC_huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    IPC_huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&IPC_huart1) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART1->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART1->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART1->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */

}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

    /* USER CODE END USART2_Init 1 */
    CH2_huart2.Instance = USART2;
    CH2_huart2.Init.BaudRate = UART2_BAUD;
    CH2_huart2.Init.WordLength = UART_WORDLENGTH_8B;
    CH2_huart2.Init.StopBits = UART_STOPBITS_1;
    CH2_huart2.Init.Parity = UART_PARITY_NONE;
    CH2_huart2.Init.Mode = UART_MODE_TX_RX;
    CH2_huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH2_huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    CH2_huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH2_huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&CH2_huart2) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART2->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART2->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART2->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
}

/**
  * @brief USART3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART3_UART_Init(void)
{


    CH3_huart3.Instance = USART3;
    CH3_huart3.Init.BaudRate = UART3_BAUD;
    CH3_huart3.Init.WordLength = UART_WORDLENGTH_8B;
    CH3_huart3.Init.StopBits = UART_STOPBITS_1;
    CH3_huart3.Init.Parity = UART_PARITY_NONE;
    CH3_huart3.Init.Mode = UART_MODE_TX_RX;
    CH3_huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH3_huart3.Init.OverSampling = UART_OVERSAMPLING_16;
    CH3_huart3.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH3_huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;


    if (HAL_UART_Init(&CH3_huart3) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART3->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART3->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */

#if UART3_FIFO_EN == 1 && UART3_DMA_RX == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    uart_dma_rx_cfg(DMA1_Channel3, DMA1_CSELR_CH3_USART3_RX_Msk, DMA1_CSELR_CH3_USART3_RX,
                    g_u3dma, &g_u3dma_last, USART3);
#else
    SET_BIT(USART3->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
#endif

}

/**
  * @brief USART4 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART4_UART_Init(void)
{



    /* USER CODE END USART4_Init 1 */
    CH4_huart4.Instance = USART4;
    CH4_huart4.Init.BaudRate = UART4_BAUD;
    CH4_huart4.Init.WordLength = UART_WORDLENGTH_8B;
    CH4_huart4.Init.StopBits = UART_STOPBITS_1;
    CH4_huart4.Init.Parity = UART_PARITY_NONE;
    CH4_huart4.Init.Mode = UART_MODE_TX_RX;
    CH4_huart4.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH4_huart4.Init.OverSampling = UART_OVERSAMPLING_16;
    CH4_huart4.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH4_huart4.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&CH4_huart4) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART4->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART4->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
#if UART4_FIFO_EN == 1 && UART4_DMA_RX == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    uart_dma_rx_cfg(DMA1_Channel1, DMA1_CSELR_CH1_USART4_RX_Msk, DMA1_CSELR_CH1_USART4_RX,
                    g_u4dma, &g_u4dma_last, USART4);
#else
    SET_BIT(USART4->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
#endif

